<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads ARCHICAD 22 Update dmg and imports into Munki.</string>
    <key>Identifier</key>
    <string>com.github.robperc.munki.ArchiCAD22Update</string>
    <key>Input</key>
    <dict>
        <key>MUNKI_REPO_SUBDIR</key>
        <string>apps</string>
        <key>NAME</key>
        <string>ArchiCAD22Update</string>
		<key>URL</key>
		<string>http://www.graphisoft.com</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.0</string>
    <key>Process</key>
    <array>
		<dict>
			<key>Processor</key>
			<string>URLTextSearcher</string>
			<key>Arguments</key>
			<dict>
				<key>url</key>
				<string>%URL%/downloads/archicad/updates/</string>
				<key>re_pattern</key>
				<string>(?P&lt;path&gt;/downloads/archicad/updates/?localization=USA&type=FULL&version=22[^"]*)</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>URLTextSearcher</string>
			<key>Arguments</key>
			<dict>
				<key>url</key>
				<string>%URL%%path%</string>
				<key>re_pattern</key>
				<string>(?P&lt;update&gt;http://dl.graphisoft.com/ftp/techsupport/downloads/ac22/ArchiCAD-22-USA-Update-.*\.dmg)</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>URLDownloader</string>
			<key>Arguments</key>
			<dict>
				<key>url</key>
				<string>%update%</string>
				<key>filename</key>
				<string>%NAME%.dmg</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>AppDmgVersioner</string>
			<key>Arguments</key>
			<dict>
				<key>dmg_path</key>
				<string>%pathname%</string>
			</dict>
		</dict>
        <dict>
	        <key>Processor</key>
	        <string>MunkiImporter</string>
            <key>Arguments</key>
            <dict>
                <key>pkg_path</key>
                <string>%pathname%</string>
                <key>repo_subdirectory</key>
                <string>%MUNKI_REPO_SUBDIR%</string>
				<key>pkginfo</key>
				<dict>
					<key>blocking_applications</key>
					<array>
					        <string>ArchiCAD22</string>
					</array>
					<key>description</key>
					<string>ArchiCAD 22 offers a streamlined workflow solution, keeping architects in the state of the creative design flow with as little disruption as possible.</string>
					<key>installer_type</key>
					<string>copy_from_dmg</string>
					<key>installs</key>
					<array>
						<dict>
							<key>CFBundleIdentifier</key>
							<string>com.graphisoft.ArchiCAD</string>
							<key>CFBundleName</key>
							<string>ArchiCAD</string>
							<key>CFBundleVersion</key>
							<string>%version%</string>
							<key>minosversion</key>
							<string>10.9.0</string>
							<key>path</key>
							<string>/Applications/GRAPHISOFT/ArchiCAD 22/ArchiCAD 22.app</string>
							<key>type</key>
							<string>application</string>
							<key>version_comparison_key</key>
							<string>CFBundleVersion</string>
						</dict>
					</array>
					<key>items_to_copy</key>
					<array>
						<dict>
							<key>destination_path</key>
							<string>/tmp</string>
							<key>group</key>
							<string>admin</string>
							<key>mode</key>
							<string>go-w</string>
							<key>source_item</key>
							<string>%app_name%</string>
							<key>user</key>
							<string>root</string>
						</dict>
					</array>
					<key>name</key>
					<string>%NAME%</string>
					<key>postinstall_script</key>
					<string>#!/bin/sh
					
					JAR="/tmp/%app_name%/Contents/Resources/Java/archive.jar"
					
					darwin_major=`/usr/bin/uname -r | /usr/bin/cut -f 1 -d .`
					
					if [ $darwin_major -gt 14 ]
					then
					
					launchctl asuser 0 java -jar "$JAR" -silent -W play.auto=YES

    					exit $?
			
					else
			
					LWPID=`ps axww | grep loginwindow | grep -v grep | awk '{print $1}'`

					launchctl bsexec $LWPID java -jar "$JAR" -W play.auto=YES -silent

					exit $?
					
					fi
					</string>
					<key>update_for</key>
					<array>
						<string>ArchiCAD22</string>
					</array>
				</dict>
            </dict>
        </dict>
    </array>
</dict>
</plist>
